import { Context } from "koishi"

const PhoneMenu = [
	'小灵通功能一览：',
	'》查看档案',
	'》查看数据',
	'》查看技能',
	'》查看装备',
	'》查看道具',
	'》查看记录'
]

const mainMenu = [
	'路昀修仙模拟器 ver 1.0.0',
	'-----------------------',
	'-入门申请　　初始化数据，并创建人物',
	'-介绍新人　　新建一个人物',
	'-写日记　　　将现在的人物更新到存档库中',
	'-工作交接　　切换人物，有两个角色时才能用',
	'-离开宗门　　删除当前人物',
	'-回忆前尘　　从旧库中继承档案',
	'-小灵通　　　查看角色',	
	'--------------------------',
	'》小灵通菜单　小灵通功能一览',
	'》路昀菜单　　打开路昀互动菜单',
	'》宗门设施　　确认每日可做的事情',
	'》地图一览　　确认可以移动的地点',
	'》弟子交流　　确认玩家之间的互动指令一览'
]

const YunMenu = [
	'路昀菜单',
	'--------------------------',
	'-陪同修炼　　邀请路昀一起修炼',
	'-共同突破　　邀请路昀一起突破',
	'-路昀商店　　可购买一些东西',
	'-查看路昀　　可查看路昀现在状态。加【选项】可查看更多选项',
	'-送礼路昀　　可将一些道具送给路昀换取些许好感度',
	'-互动指南　　查看好感／信赖互动指南'
]

const WorkMenu = [
	'宗门设施一览',
	'----------------------------',
	'· 洞天峰　　可进行修炼与突破。相关指令：-修炼，-突破',
	'· 藏经阁　　可进行学习、查阅等。相关指令：-查阅，-整理书架',
	'· 弟子观　　大家进行日常学习的地方。相关指令：-修习心法，-休养生息',
	'· 灵矿峰　　可以进行挖矿，冶炼。相关指令：-炼器，-挖矿',
	'· 灵植峰　　可进行采药、种地、炼丹等。相关指令：-炼丹，-采药，-种植',
	'· 后山秘境　可进行探险，打怪升级。相关指令：-探索',
]

export function GameMenu(ctx: Context){
	ctx.command('menu <type>','-主菜单　路昀修仙模拟器主菜单',{system:true})
		.alias('主菜单').alias('游戏目录')
		.shortcut('》小灵通菜单',{args:['phone']})
		.shortcut('》路昀菜单',{args:['yun']})
		.shortcut('》宗门设施', {args:['work']})
		.action(({session},type)=>{
			if(!type) return mainMenu.join('\n');
			switch(type){
				case 'phone':
					return PhoneMenu.join('\n')
				case 'yun':
					return YunMenu.join('\n')
				case 'work':
					return WorkMenu.join('\n')
			}
		})
}