//周公灵签
//https://www.zgjm.org/chouqian/zhougong/1.html
import { between, random } from "../Utils"

const zgpool = [
	[1, 1],
	[2, 10],
	[11, 13],
	[14, 21],
	[22, 29],
	[30, 48],
	[49, 51],
	[52, 52],
	[53, 55],
	[56, 60],
	[61, 89],
	[90, 91],
	[92, 100],
]

const zglq = [
	{ id: 1, no: 49, luck: '下下', title: '太子丹尊事荆轲', text: '营图万事若冰澌，何必悭贪苦所为\n只好静心闲处坐，待他兴变复奚疑' },

	{ id: 2, no: 3, luck: '下', title: '燕将独守聊城', text: '冲风冒雨去还归，役役劳身似燕儿\n衔得泥来成叠后，到头叠坏复成泥' },
	{ id: 3, no: 10, luck: '下', title: '秦昭王连城求赵璧', text: '椟藏无价宝和珍，只管他乡外处寻\n好似将灯来觅火，不如安静莫劳心' },
	{ id: 4, no: 15, luck: '下', title: '商君不听赵良言', text: '触人口气最难吞，忽有灾危祸到门\n卵破巢空无宿处，深为稳便把心存' },
	{ id: 5, no: 24, luck: '下', title: '文种不听范少伯', text: '不成邻里不成家，水泡痴人似落花\n芳问君恩难得力，到头毕竟事如麻' },
	{ id: 6, no: 52, luck: '下', title: '李太白醉中捉月', text: '水中捉月费工夫，费尽功夫却又无\n莫信闲言并浪论，枉抛心力也难图' },
	{ id: 7, no: 63, luck: '下', title: '黄孝子万里寻亲', text: '昔日行船失了针，今朝依旧海中寻\n若还寻得原针在，也费工夫也费心' },
	{ id: 8, no: 64, luck: '下', title: '石崇被害', text: '譬若金鳞放碧漪，暗遭罗网四边围\n思量无计翻身出，命到泉关苦独悲' },
	{ id: 9, no: 70, luck: '下', title: '诸葛与关公说亲', text: '朝朝役役恰如蜂，飞来飞去西复东\n春暮花残无觅处，此身不恋旧丛中' },
	{ id: 10, no: 98, luck: '下', title: '陶渊明三径关门', text: '经商出入事迟疑，恐惹闲愁与是非\n如鸟飞投罗网陷，相看能有几人知' },

	{ id: 11, no: 26, luck: '平', title: '桓温得殷浩书', text: '上下传来事总虚，天边接得一封书\n书中许我功名事，直待终时亦是无' },
	{ id: 12, no: 37, luck: '平', title: '管公明避隐辽东', text: '欲问身安运泰时，风中灯烛不相宜\n争如收拾深堂坐，庶免光摇静处期' },
	{ id: 13, no: 40, luck: '平', title: '马援女为皇后', text: '红轮西坠兔东升，阴长阳消是两形\n若是女人占此卦，增添福禄称心情' },

	{ id: 14, no: 41, luck: '中下', title: '董卓郿坞藏金', text: '无限好事君须记，恰如认贼作为子\n莫贪眼下有些甜，可虑他时还受苦' },
	{ id: 15, no: 54, luck: '中下', title: '吕仙枕黄梁未熟', text: '梦中得宝醒来无，应说巫山只是虚\n苦问婚姻并病讼，别寻生路得相宜' },
	{ id: 16, no: 74, luck: '中下', title: '韩非入秦被害', text: '慵飞野鹤自投笼，欲举鹏霄落陷中\n南北东西浑障碍，此身憔悴恨无穷' },
	{ id: 17, no: 65, luck: '中下', title: '越王句践栖会稽山', text: '眼前欢喜未为欢，危不危兮安不安\n割肉成疮因甚事，不如守旧得安全' },
	{ id: 18, no: 77, luck: '中下', title: '范睢相秦', text: '梦中说梦获多财，身外浮名总莫猜\n水远山遥难信定，贵人一指笑颜开' },
	{ id: 19, no: 84, luck: '中下', title: '李广灞陵夜猎', text: '因名丧德不和同，切忌忙中变作凶\n醉後不知何处去，青松影里睡朦胧' },
	{ id: 20, no: 97, luck: '中下', title: '邓通铜铸钱', text: '园林月色摇疎影，恍若铺成满地琼\n几度儿童来收拾，岂知收拾总无成' },
	{ id: 21, no: 100, luck: '中下', title: '楚襄王阳台梦醒', text: '欲就东兮欲就西，逢人说事转痴迷\n登山不见神仙面，莫若归休更勿提' },

	{ id: 22, no: 5, luck: '中平', title: '燕昭王为郭隗筑黄金台', text: '一锄掘地要求泉，努力求之得最先\n无意俄然遇知己，相逢携手上青天' },
	{ id: 23, no: 6, luck: '中平', title: '蔺相如完璧归赵', text: '投身岩下饲於菟，须是还他大丈夫\n舍己也应难再得，通行天下此人无' },
	{ id: 24, no: 38, luck: '中平', title: '淮阴侯背楚归汉', text: '镜月当空出匣时，刹那云雾暗迷离\n宽心守待浮云散，更改相宜可望为' },
	{ id: 25, no: 39, luck: '中平', title: '曹操遣襧衡投黄祖', text: '天边消息应难问，切莫私心强望求\n若把石头磨作镜，精神枉费一时休' },
	{ id: 26, no: 56, luck: '中平', title: '范少伯泛舟五湖', text: '涧小石粗流水响，力劳撑驾恐损伤\n路须指出前江去，风静潮平尽不妨' },
	{ id: 27, no: 59, luck: '中平', title: '李德裕贬崖州', text: '直上高楼去避身，四边绕处是荆棘\n谁知造物安排定，得意番成失意人' },
	{ id: 28, no: 87, luck: '中平', title: '魏武帝羊肠失路', text: '人行半岭日衔山，峻险巉岩未可攀\n仰望上天垂护佑，此身犹在太虚间' },
	{ id: 29, no: 88, luck: '中平', title: '张子房误中副车', text: '木雕一虎在山林，远望威容意不禁\n纵说不妨终可畏，此身如入大江心' },

	{ id: 30, no: 2, luck: '中', title: '姜太公渭水垂钓', text: '鲸鱼未化守江湖，未许升腾离碧波\n异日峥嵘身变态，从教一跃禹门过' },
	{ id: 31, no: 4, luck: '中', title: '长乐老历相五代', text: '菱花镜破复重圆，女再求夫男再婚\n自此门闾重改换，更添福禄与儿孙' },
	{ id: 32, no: 7, luck: '中', title: '廉将军思用赵人', text: '奔波役役重重险，带水拖泥又渡山\n更虑他方求别用，千山万水未能还' },
	{ id: 33, no: 17, luck: '中', title: '李斯遗药杀韩非', text: '莫听闲言与是非，晨昏只好念阿弥\n若将妄语为真实，画饼如何疗得饥' },
	{ id: 34, no: 19, luck: '中', title: '杨雄仕新为莽大夫', text: '急水滩头放艇时，狂风作浪欲何为\n待他浪静风停後，稳载船归过不危' },
	{ id: 35, no: 27, luck: '中', title: '李邺侯白衣宰相', text: '一谋一用一番机，虑後疑前不敢为\n时至自然逢贵助，银墙铁壁好安居' },
	{ id: 36, no: 30, luck: '中', title: '楚怀主入秦武关', text: '劝君切莫向他求，似鹤飞来暗箭投\n若去采薪蛇伏草，恐遭毒手也堪忧' },
	{ id: 37, no: 33, luck: '中', title: '鲍叔进管仲', text: '石藏美玉在中心，得指何须向外寻\n直待高人来剖析，恰如灵雨涤烦襟' },
	{ id: 38, no: 44, luck: '中', title: '周郎赤壁败曹兵', text: '棋逢敌手要藏机，黑白盘中未决时\n到底欲知谁胜负，须教先着相机宜' },
	{ id: 39, no: 58, luck: '中', title: '罗隐归咎越王', text: '忠言善言君须记，莫向他方求别艺\n劝君安守旧生涯，除却有余都不是' },
	{ id: 40, no: 60, luck: '中', title: '先主连营', text: '抱薪救火火增烟，烧却三千及大千\n若问营谋并出入，不如收拾莫忧燃' },
	{ id: 41, no: 62, luck: '中', title: '吕蒙正破窑守困', text: '晨昏全赖佛扶持，虽是逢危不见危\n若得贵人来接引，此时福禄自相随' },
	{ id: 42, no: 66, luck: '中', title: '楚霸王阴陵失道', text: '路险马行人去远，失群羊困虎相当\n危滩船过风翻浪，春暮花残天降霜' },
	{ id: 43, no: 72, luck: '中', title: '刘智远打磨房', text: '弄蜂须要求他蜜，犹恐遭他尾上针\n虽是眼前有异路，暗里深藏荆棘林' },
	{ id: 44, no: 75, luck: '中', title: '伍子胥中流得兰桨', text: '宛如抱虎过山前，战战兢兢胆碎寒\n幸得山前逢妙手，方能保得一身安' },
	{ id: 45, no: 81, luck: '中', title: '风送藤王阁', text: '庭前叶落暮秋时，行客奔程势若飞\n谢得天公轻着力，顺风相送宝船归' },
	{ id: 46, no: 82, luck: '中', title: '吕纯阳重生梓树', text: '炎炎烈火焰烧天，焰里还生一朵莲\n到底永成根不坏，依然枝叶色新鲜' },
	{ id: 47, no: 93, luck: '中', title: '卫懿公赐鹤乘轩', text: '鸾凤翎毛雨压垂，此时应被雀轻欺\n忽朝一日云霄霁，依旧还教振羽衣' },
	{ id: 48, no: 94, luck: '中', title: '王君公避世墙东', text: '小人君子别贤愚，事有差讹合是非\n琴遇知音当鼓操，争如定静得便宜' },

	{ id: 49, no: 16, luck: '中上', title: '明神宗要活海瑞', text: '攒眉思虑暂时开，咫尺云开见日来\n宛似污泥中片玉，良工一举出尘埃' },
	{ id: 50, no: 69, luck: '中上', title: '程婴匿孤存赵', text: '冬来岭上一枝梅，叶落枯枝总不摧\n探得阳春消息近，依然还我作花魁' },
	{ id: 51, no: 83, luck: '中上', title: '马周入都投旅店', text: '譬若初三四五蟾，半无半有未完全\n须教十五良宵夜，到处清光到处圆' },

	{ id: 52, no: 42, luck: '上', title: '温公入相除新法', text: '君垂恩泽润无边，覆祷祈禳没党偏\n一切有情皆受用，均沾乐利得周全' },

	{ id: 53, no: 23, luck: '上平', title: '孙策以玺借袁兵', text: '欲攀仙桂蟾宫去，岂虑天门不放开\n谋望一般音信好，高人自送岭头来' },
	{ id: 54, no: 46, luck: '上平', title: '赵韩王为村学究', text: '劝君耐守旧生涯，把定身心莫听邪\n直待有人轻着力，满园枯木再开花' },
	{ id: 55, no: 51, luck: '上平', title: '诸葛公隆中高卧', text: '夏日初临日正长，人皆愁恼热非常\n天公也解诸人意，故遣薰风特送凉' },

	{ id: 56, no: 25, luck: '上中', title: '伍子胥过昭关', text: '过了忧危第几重，从今再历永无凶\n宽心自有宽心计，得遇高人护圣功' },
	{ id: 57, no: 31, luck: '上中', title: '达摩面壁', text: '清闲无事静处坐，饥时吃饭困时卧\n放下身心不用忙，必定不遭殃与祸' },
	{ id: 58, no: 57, luck: '上中', title: '甯戚饭牛叩角', text: '闻是闻非风过耳，好衣好禄日当空\n君须记取他年事，汝意还同我意同' },
	{ id: 59, no: 78, luck: '上中', title: '秦宓屈张温', text: '冷水来浇白雪洋，不寒不热自温凉\n要行天下无他事，惟有中藏一艺强' },
	{ id: 60, no: 79, luck: '上中', title: '魏颗得老人结草', text: '虚空结愿结人缘，保得人安愿未还\n得兔忘蹄真绝迹，敢将初誓谩轻瞄' },

	{ id: 61, no: 1, luck: '上上', title: '宋太祖黄袍加身', text: '天开地辟结良缘，日吉时良万事全\n若得此签非小可，人行中正帝王宣' },
	{ id: 62, no: 8, luck: '上上', title: '范文公断虀画粥', text: '岁寒松柏古栽培，雨雪风霜总不摧\n异日必当成大用，功名作个栋梁材' },
	{ id: 63, no: 9, luck: '上上', title: '赵韩王半部论语定天下', text: '劳君问我心中事，此意偏宜说向公\n一片灵台明似镜，恰如明月正当空' },
	{ id: 64, no: 11, luck: '上上', title: '刘先生入赘东吴', text: '欲求好事喜非常，争奈姻亲只暂忙\n毕竟到头成好事，贵人接引贵人乡' },
	{ id: 65, no: 12, luck: '上上', title: '包胥九顿泣秦庭', text: '时临否极泰当来，抖擞从君出暗埃\n若遇卯寅佳信至，管教立志事和谐' },
	{ id: 66, no: 13, luck: '上上', title: '信陵君存赵辞封', text: '自小生身富贵家，眼前万事总奢华\n要君赐受金鱼袋，四海传名足可夸' },
	{ id: 67, no: 18, luck: '上上', title: '鬼谷子演课', text: '金乌西坠兔东临，日夜循环恒古今\n僧道得之无不利，工商农士各开心' },
	{ id: 68, no: 20, luck: '上上', title: '苏武援官典属国', text: '当春久雨喜初晴，玉兔金乌渐渐明\n旧事已成新事遂，看看一跳入蓬瀛' },
	{ id: 69, no: 28, luck: '上上', title: '孟尝君鸡鸣度关', text: '东方月上正婵娟，顷刻云遮月半边\n莫道圆时还又缺，须教缺处复重圆' },
	{ id: 70, no: 32, luck: '上上', title: '常何荐马周', text: '渺渺前途事可疑，石中藏玉有谁知\n一朝良匠分明剖，始觉其中碧玉奇' },
	{ id: 71, no: 34, luck: '上上', title: '文中子上太平策', text: '出入行藏礼义恭，言必忠良听必聪\n心下了然俱洞彻，光明如日正当空' },
	{ id: 72, no: 35, luck: '上上', title: '刘关张古城相会', text: '衣冠重整旧宿风，道是无功却有功\n扫却当途荆棘碍，三人共议事相同' },
	{ id: 73, no: 36, luck: '上上', title: '刘先主进葭萠关', text: '目前病讼不须忧，实地资财尽可求\n恰好系猿今脱锁，得归仙洞去来游' },
	{ id: 74, no: 45, luck: '上上', title: '张良受书圯上老人', text: '温柔自是胜强刚，积善于门大吉昌\n若是有人占此卦，宛如止渴遇琼浆' },
	{ id: 75, no: 47, luck: '上上', title: '高远夫五十得名', text: '锦上添花色更鲜，运来禄马喜双全\n时人莫讶功名晚，一举登科四海传' },
	{ id: 76, no: 53, luck: '上上', title: '王景略扪虱谈兵', text: '失意翻成得意时，龙吟虎啸两相宜\n青云有路终须到，许我功名必可期' },
	{ id: 77, no: 67, luck: '上上', title: '管仲相齐', text: '一条金秤等君情，无减无增无重轻\n为是平生心正直，文章不识义皆明' },
	{ id: 78, no: 68, luck: '上上', title: '李吉甫三代为相', text: '门庭清吉梦祯祥，积善于门大吉昌\n讼理婚成蚕又熟，病逢良药得安康' },
	{ id: 79, no: 71, luck: '上上', title: '貂蝉从王司徒计', text: '谁知爱宠遇强徒，女子当年嫁二夫\n自是一弓施两箭，骑龙跨虎上安居' },
	{ id: 80, no: 73, luck: '上上', title: '萧何月下追韩信', text: '春雷震起蛰中虫，脱却尘凡出旧墉\n忽遇风云交际处，自然变化得成龙' },
	{ id: 81, no: 76, luck: '上上', title: '孙叔敖隐处海滨', text: '鱼龙混杂意和同，耐守寒潭未济中\n不觉一朝头角耸，禹门一跳到天宫' },
	{ id: 82, no: 80, luck: '上上', title: '郭令公免胄见吐蕃', text: '直上高山去学仙，岂知一旦帝王宣\n青天白日常明照，志在声名四海传' },
	{ id: 83, no: 85, luck: '上上', title: '苏秦抵掌华屋', text: '重开山後藏前事，万宝园中可再团\n醉咏新诗添逸兴，贵人引接上云衢' },
	{ id: 84, no: 89, luck: '上上', title: '姜太公渭水遇文王', text: '出入营谋大吉昌，无瑕玉在石中藏\n如今幸得高人指，获宝从心喜不常' },
	{ id: 85, no: 90, luck: '上上', title: '刘先主如鱼得水', text: '忽朝一信下天墀，宝贝船装满载归\n若问前程成底事，始终应得贵人提' },
	{ id: 86, no: 91, luck: '上上', title: '宗悫长风破浪', text: '好把愁眉须展开，大才大用荐将来\n一条大路平如掌，凡有施为总称怀' },
	{ id: 87, no: 92, luck: '上上', title: '李固言柳汁染衣', text: '经商得利称心怀，福禄荣华倍获财\n若问进身谋望事，秀才一举状元回' },
	{ id: 88, no: 95, luck: '上上', title: '刘太尉闻鸡起舞', text: '事业功勤暮与朝，荣华物态不胜饶\n报君记取金鸡斗，福禄声名价自超' },
	{ id: 89, no: 96, luck: '上上', title: '汾阳王七夕天孙', text: '巍巍宝塔不寻常，八面玲珑尽放光\n劝汝志心勤顶礼，天龙拥护降千祥' },

	{ id: 90, no: 21, luck: '上吉', title: '邵康节定阴阳', text: '阴阳道合总由天，女嫁男婚岂偶然\n但看龙蛇堪运动，熊罴叶梦喜团圆' },
	{ id: 91, no: 22, luck: '上吉', title: '王孝先为民祈祷', text: '四郊田亩皆枯竭，久旱俄然三日霖\n花果草芽俱润泽，始知一雨值千金' },

	{ id: 92, no: 14, luck: '大吉', title: '管仲三熏三沐见齐桓', text: '宛如仙鹤出樊笼，脱却羁縻处处通\n南北东西无障碍，任君直上九霄中' },
	{ id: 93, no: 29, luck: '大吉', title: '百里奚食牛入相', text: '宝剑光芒出匣时，匣中应不被尘欺\n贵人亲手提携起，尽可防身更勿疑' },
	{ id: 94, no: 43, luck: '大吉', title: '泗水亭长作天子', text: '天地交泰万物新，自形自色自怡神\n森罗万象皆精彩，事事和谐得称人' },
	{ id: 95, no: 48, luck: '大吉', title: '班超万里封侯', text: '鵾鸟秋光化作鹏，翱翔得意尽飞腾\n直冲万里云霄外，任是诸禽总不能' },
	{ id: 96, no: 48, luck: '大吉', title: '班超万里封侯', text: '鵾鸟秋光化作鹏，翱翔得意尽飞腾\n直冲万里云霄外，任是诸禽总不能' },
	{ id: 97, no: 50, luck: '大吉', title: '三宝太监下西洋', text: '五湖四海尽行船，高挂风帆把舵坚\n幸得顺风随所至，满船宝贝称心田' },
	{ id: 98, no: 55, luck: '大吉', title: '郭暧尚公主', text: '相传罔替子孙贤，衣禄丰盈富在天\n金马玉堂人快乐，饥时吃饭困时眠' },
	{ id: 99, no: 61, luck: '大吉', title: '厮养卒走燕取归赵王', text: '日上吟诗月下歌，逢场作戏笑呵呵\n相逢会处难藏隐，喝采齐声嗹哩罗' },
	{ id: 100, no: 86, luck: '大吉', title: '西王母献益地图', text: '春来花发映阳台，万里舟行进宝来\n跃过禹门三级浪，恰如平地一声雷' },
]

function zhougong(int) {
	let i
	for (let c in zgpool) {
		if (between(int, zgpool[c][0], zgpool[c][1])) {
			i = random(zgpool[c][0], zgpool[c][1]) - 1
			return zglq[i]
		}
	}
	return zglq[0]
}

export {
	zhougong, zglq, zgpool
}